tap "laishulu/homebrew"

# === シェル・ターミナル ===
brew "zsh-autosuggestions"    # 履歴から補完候補を表示
brew "starship"               # プロンプトカスタマイズ
brew "direnv"                 # ディレクトリごとの環境変数管理

# === エディタ ===
brew "neovim"

# === 検索・ファイル操作 ===
brew "fzf"                    # ファジーファインダー（Ctrl+R で履歴検索）
brew "zoxide"                 # cd の代替（frecency で賢くディレクトリ移動）
brew "ripgrep"                # 高速 grep（Neovim Telescope でも使用）
brew "tree"                   # ディレクトリ構造の表示
brew "trash"                  # rm の代わりに使用（復元可能）

# === 開発ツール ===
brew "gh"                     # GitHub CLI
brew "mise"                   # ランタイムバージョン管理（Node / Python 等）
brew "lazygit"                # Git TUI クライアント（Neovim から呼び出し可能）
brew "node"                   # Node.js / npm（Mason LSP: typescript-language-server, pyright 等）
brew "go"                     # Go 言語（Mason LSP: gopls）

# === macOS ユーティリティ ===
brew "defaultbrowser"         # デフォルトブラウザを CLI から設定
brew "laishulu/homebrew/macism"   # IME 切り替え（Neovim で Normal モード時に英数へ）
brew "socat"                  # ソケット通信ユーティリティ

cask "1password"
cask "alt-tab"
cask "aqua-voice"
cask "arc"
cask "chatwork"
cask "cleanshot"
cask "codex"                  # OpenAI Codex CLI（Claude CodeからMCPサーバーとして呼び出し）
cask "discord"
# cask "displaylink"  # sudoが必要なため手動インストール: brew install --cask displaylink
cask "font-hackgen"
cask "font-moralerspace"
cask "ghostty"
cask "google-chrome"
cask "logi-options+"
cask "nani"
cask "notion"
cask "obsidian"
# cask "positron"  # ダウンロードURLが壊れているため一時的にコメントアウト
cask "raindropio"
cask "raycast"
cask "slack"
brew "xcodegen"
brew "postgresql@17"
